<a href="https://colab.research.google.com/github/CindyYWangH/pb_Python/blob/main/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Working with Pandas

In this course, you will learn about the Python Pandas library built upon NumPy, which provides data manipulation and analysis methods for structured data frames.

#### Introducing pandas Series, pandas DataFrames, and pandas Indexes

pandas Series, pandas DataFrames, and pandas Indexes are the fundamental pandas data structures.

## pandas.Series

The pandas.Series data structure represents a one-dimensional series of homogenous values (integer values, string values, double/float values, and so on). Series are a type of list and can contain only a single list with an index. A Data Frame, on the other hand, is a collection of one or more series.

Let's create a pandas.Series data structure:

In [ ]:
# Always import pandas library first. Henceforth, 
# when you see "pd" it refers to 
# calling pandas and using its functionalities.
import pandas as pd

In [ ]:
#This series contains the index in the first column, 
#and in the second column, the index's corresponding values.
ser1 = pd.Series(range(0,7,2))
ser1

0    0
1    2
2    4
3    6
dtype: int64

In [ ]:
#We can specify custom index names by specifying the 
#index parameter.
ser2 = pd.Series(range(1, 6), index=['a', 'b', 'c', 'd', 'e'])
ser2

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
#We can also create a series by specifying the 
#index -> value mapping via a dictionary.
ser3 = pd.Series({ 'M': 1, 'b': 2, 'c': 3, 'd': 4, 'e': 5})
ser3

M    1
b    2
c    3
d    4
e    5
dtype: int64

In [ ]:
#The pandas.Series.index attribute lets us access the index.
# As you can see,the index is of type pandas.Index.
ser3.index

Index(['M', 'b', 'c', 'd', 'e'], dtype='object')

In [ ]:
# The values of the series can also be accessed using the 
#pandas.Series.values attribute:
ser3.values

array([1, 2, 3, 4, 5])

## pandas.DataFrame

 Now let's learn about DataFrames, a data structure that may contain multiple Pandas Series.

The pandas.DataFrame data structure is a collection of multiple pandas.Series objects of possibly different types indexed by the same common Index object.

The majority of data science operations are performed on DataFrames and pandas.DataFrame is optimized for parallel super-fast processing of DataFrames, much faster than if the processing was done on separate series.

In [ ]:
#We can create a DataFrame from a dictionary, where the 
#key is the column name and the value 
#of that key contains the data for the corresponding 
#series/column:
data = {'A': range(1,5,1), 'B': range(10,50,10), 
                    'C': range(100, 500, 100)}
data

{'A': range(1, 5), 'B': range(10, 50, 10), 'C': range(100, 500, 100)}

In [ ]:
df1 = pd.DataFrame(data)
df1

   A   B    C
0  1  10  100
1  2  20  200
2  3  30  300
3  4  40  400

In [ ]:
df1.columns #returns the columnns

Index(['A', 'B', 'C'], dtype='object')

In [ ]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 224.0 bytes

In [ ]:
df1.describe().T

   count   mean         std    min     25%    50%     75%    max
A    4.0    2.5    1.290994    1.0    1.75    2.5    3.25    4.0
B    4.0   25.0   12.909944   10.0   17.50   25.0   32.50   40.0
C    4.0  250.0  129.099445  100.0  175.00  250.0  325.00  400.0

In [ ]:
#We can also pass the index= parameter here to label the indices:
df2 = pd.DataFrame({'A': range(1,5,1), 'B': range(10,50,10), 
                    'C': range(100, 500, 100)}, index=['a', 'b', 'c', 'd'])
df2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, a to d
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       4 non-null      int64
 1   B       4 non-null      int64
 2   C       4 non-null      int64
dtypes: int64(3)
memory usage: 128.0+ bytes

In [ ]:
#The pandas.DataFrame.columns attribute returns the 
#names of the different columns.
# The result is an Index object.
df2.columns

Index(['A', 'B', 'C'], dtype='object')

In [ ]:
#The indices can be accessed from the pandas.DataFrame.index 
#attribute.
df2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [ ]:
#The DataFrame also contains the pandas.DataFrame.values attribute,
#which returns the values contained in the columns.
#The result is the following 2D array.

df2.values

array([[  1,  10, 100],
       [  2,  20, 200],
       [  3,  30, 300],
       [  4,  40, 400]])

### Subsetting columns

In [ ]:
df2

   A   B    C
a  1  10  100
b  2  20  200
c  3  30  300
d  4  40  400

In [ ]:
df2['A']

a    1
b    2
c    3
d    4
Name: A, dtype: int64

In [ ]:
df2[['A', 'C']]

   A    C
a  1  100
b  2  200
c  3  300
d  4  400

In [ ]:
len(df2) #returns the number of rows contained in the dataframe

4

### Adding another column

In [ ]:
df2

   A   B    C
a  1  10  100
b  2  20  200
c  3  30  300
d  4  40  400

In [ ]:
df2['D']

KeyError: ignored

In [ ]:
#We can add a new column to the DataFrame with specified values 
#and the same index.
#The updated DataFrame is as follows:

df2['D'] = range(1000,5000,1000)
df2

   A   B    C     D
a  1  10  100  1000
b  2  20  200  2000
c  3  30  300  3000
d  4  40  400  4000

In [ ]:
df2.index.name

In [ ]:
#We can assign names to the DataFrame's index and columns.
#We can name the index by modifying the pandas.DataFrame.index.name
#attribute:
df2.index.name = 'lowercase'
df2

           A   B    C     D
lowercase
a          1  10  100  1000
b          2  20  200  2000
c          3  30  300  3000
d          4  40  400  4000

In [ ]:
df2.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [ ]:
df2.index.name

In [ ]:
#The columns can also be renamed using the 
#pandas.DataFrame.columns.name attribute:
df2.columns.name = 'uppercase'
df2

uppercase  A   B    C     D
lowercase
a          1  10  100  1000
b          2  20  200  2000
c          3  30  300  3000
d          4  40  400  4000

## pandas.Index

Both the pandas.Series and pandas.DataFrame data structures utilize the pandas.Index data structure.

There are many special types of Index objects:

* Int64Index: Int64Index contains integer index values.
* MultiIndex: MultiIndex contains indices that are tuples used in hierarchical indexing, which we will explore in this course.
* DatetimeIndex: DatetimeIndex contains datetime index values for time series datasets.

In [ ]:
#We can create a pandas.Index object by doing the following:
ind1 = pd.Index(range(5))
ind1

In [ ]:
a = range(5)
a

In [ ]:
#We can create a pandas.Index object by doing the following:
ind2 = pd.Index(list(range(5)))
ind2

In [ ]:
#Index objects are immutable and thus cannot be modified in place.
#Let's see what happens if we try to modify an element in an Index 
#object:

ind2[0] = -1

In [ ]:
ind2[1:4]

# Essential pandas.DataFrame Operations

### Indexing, Selection and Filtering of DataFrames

In [ ]:
#Let's inspect the contents of the df2 DataFrame created earlier.
df2

In [ ]:
df2.shape

(4, 4)

In [ ]:
#We can select the Series of values in column B by performing 
#the following operation:
df2['B']

In [ ]:
#We can select multiple columns by passing a list of column 
#names (somewhat similar to what we saw with numpy.ndarrays).
df2[['A', 'C']]

uppercase  A    C
lowercase
a          1  100
b          2  200
c          3  300
d          4  400

In [ ]:
df2

In [ ]:
#We can use Boolean selection with DataFrames by doing the 
#following. This selects the following rows, which satisfy 
#the provided condition:


df2[(df2['D'] > 1000) & (df2['D'] <= 3000)]

uppercase  A   B    C     D
lowercase
b          2  20  200  2000
c          3  30  300  3000

In [ ]:
#The pandas.DataFrame.loc[...] attribute lets us index 
#rows instead of columns. 
#The following selects the two rows c and d:

df2.loc[['c', 'd']]

KeyError: ignored

In [ ]:
#pandas DataFrames still support standard integer indexing through 
#the pandas.DataFrame.iloc[...] attribute. We can select the first
#row by doing this:

df2.iloc[[0]] 
#This selects the following single-row DataFrame:

uppercase  A   B    C     D
lowercase
a          1  10  100  1000

In [ ]:
df2

In [ ]:
#We can modify the DataFrame with an operation like this:
df2[df2['D'] == 2000] = 0
df2

In [ ]:
df2

In [ ]:
df2[(df2['D'] == 3000)] = 0
df2

## Dropping Rows and Columns from a DataFrame

Dropping rows and columns from a DataFrame is a critical operation – it not only helps save the computer's memory but also ensures that the DataFrame contains only logically needed information. The steps are as follows:

In [ ]:
#Let's display our current DataFrame.
df2

In [ ]:
#To drop the row at index b, we use the pandas.DataFrame.drop(...) 
#method.This yields a new DataFrame without the row at index b:
df2.drop('b')

In [ ]:
df2

In [ ]:
#Let's check whether the original DataFrame was changed:
# It hasn't change, that means by default drop does not 
# affect the original dataframe.
df2

In [ ]:
# So,to modify the original DataFrame, we use the 
#inplace= parameter:
df2.drop('b', inplace=True)
df2

In [ ]:
#We can drop multiple rows as well:
df2.drop(['a', 'd'])

In [ ]:
#To drop columns instead of rows, we specify the additional 
#axis= parameter:
df2.drop(['A', 'B'], axis=1)

In [ ]:
df2

## Sorting Values and Ranking the Values Order within a DataFrame

In [ ]:
import numpy as np
import pandas as pd
np.random.seed(0)

First, let's create a DataFrame with integer row indices, integer column names, and random values:

In [ ]:
np.random.seed(0)
df = pd.DataFrame(np.random.randn(5,5), 
                  index=np.random.randint(0, 100, size=5), 
                  columns=np.random.randint(0, 100, size=5))
df

          17        79        4         42        58
0   1.764052  0.400157  0.978738  2.240893  1.867558
36 -0.977278  0.950088 -0.151357 -0.103219  0.410599
53  0.144044  1.454274  0.761038  0.121675  0.443863
5   0.333674  1.494079 -0.205158  0.313068 -0.854096
38 -2.552990  0.653619  0.864436 -0.742165  2.269755

In [ ]:
#pandas.DataFrame.sort_index(...) sorts the DataFrame by 
#index values: 
df.sort_index(inplace = True)
df

          17        79        4         42        58
0   1.764052  0.400157  0.978738  2.240893  1.867558
5   0.333674  1.494079 -0.205158  0.313068 -0.854096
36 -0.977278  0.950088 -0.151357 -0.103219  0.410599
38 -2.552990  0.653619  0.864436 -0.742165  2.269755
53  0.144044  1.454274  0.761038  0.121675  0.443863

In [ ]:
#We can also sort by column name values by specifying the
#axis parameter:
df.sort_index(axis=1, inplace = True) 
df

          4         17        42        58        79
0   0.978738  1.764052  2.240893  1.867558  0.400157
5  -0.205158  0.333674  0.313068 -0.854096  1.494079
36 -0.151357 -0.977278 -0.103219  0.410599  0.950088
38  0.864436 -2.552990 -0.742165  2.269755  0.653619
53  0.761038  0.144044  0.121675  0.443863  1.454274

In [ ]:
df

          4         17        42        58        79
0   0.978738  1.764052  2.240893  1.867558  0.400157
5  -0.205158  0.333674  0.313068 -0.854096  1.494079
36 -0.151357 -0.977278 -0.103219  0.410599  0.950088
38  0.864436 -2.552990 -0.742165  2.269755  0.653619
53  0.761038  0.144044  0.121675  0.443863  1.454274

In [ ]:
df.columns

Int64Index([4, 17, 42, 58, 79], dtype='int64')

In [ ]:
df.columns[2]

42

In [ ]:
#To sort the values in the DataFrame, we use the 
#pandas.DataFrame.sort_values(...) method, 
#which takes a by= parameter specifying which column(s) 
#to sort by.This yields the following DataFrame sorted by 
#the values in the first column:

df.sort_values(by=df.columns[0], inplace = True)

In [ ]:
df

          4         17        42        58        79
5  -0.205158  0.333674  0.313068 -0.854096  1.494079
36 -0.151357 -0.977278 -0.103219  0.410599  0.950088
53  0.761038  0.144044  0.121675  0.443863  1.454274
38  0.864436 -2.552990 -0.742165  2.269755  0.653619
0   0.978738  1.764052  2.240893  1.867558  0.400157

In [ ]:
#The pandas.DataFrame.rank(...) method yields a DataFrame 
#containing the rank/order of values in each column.
#The output contains the rank (in ascending order) of values.
df.rank()

     4    17   42   58   79
5   1.0  4.0  4.0  1.0  5.0
36  2.0  2.0  2.0  2.0  3.0
53  3.0  3.0  3.0  3.0  4.0
38  4.0  1.0  1.0  5.0  2.0
0   5.0  5.0  5.0  4.0  1.0

## Arithmetic Operations on DataFrames

First, let's create two DataFrames for our examples:

In [ ]:
df1 = pd.DataFrame(np.random.randn(3,2), 
                   index=['A', 'C', 'E'], 
                   columns=['colA', 'colB'])
df1

       colA      colB
A -1.454366  0.815270
C  0.229098 -1.026179
E  0.477525  1.292698

In [ ]:
df2 = pd.DataFrame(np.random.randn(4,3), 
                   index=['A', 'B', 'C', 'D'], 
                   columns=['colA', 'colB', 'colC'])
df2

       colA      colB      colC
A -0.731458 -1.605402  0.989476
B  0.110815 -0.380931  0.114959
C  0.345313 -1.734959  1.658351
D  2.299772 -0.471135  1.262715

In [ ]:
#We can add the two DataFrames together. Note that they have 
#different index values as well as different columns.
# The output is a summation of elements if the index and 
#column exists in both DataFrames, otherwise it is NaN.
df1 + df2

       colA      colB  colC
A -2.185824 -0.790132   NaN
B       NaN       NaN   NaN
C  0.574411 -2.761138   NaN
D       NaN       NaN   NaN
E       NaN       NaN   NaN

In [ ]:
2 + np.nan

nan

In [ ]:
#We can use the pandas.DataFrame.add(...) method with fill_value= 
#to a value to be used instead of NaN (in this case 0):
df1.add(df2, fill_value=0)

       colA      colB      colC
A -2.185824 -0.790132  0.989476
B  0.110815 -0.380931  0.114959
C  0.574411 -2.761138  1.658351
D  2.299772 -0.471135  1.262715
E  0.477525  1.292698       NaN

In [ ]:
#We can perform arithmetic operations between DataFrames and 
#Series as well:

In [ ]:
df1

       colA      colB
A -1.454366  0.815270
C  0.229098 -1.026179
E  0.477525  1.292698

In [ ]:
df2

       colA      colB      colC
A -0.731458 -1.605402  0.989476
B  0.110815 -0.380931  0.114959
C  0.345313 -1.734959  1.658351
D  2.299772 -0.471135  1.262715

In [ ]:
df2['colA']

A   -0.731458
B    0.110815
C    0.345313
D    2.299772
Name: colA, dtype: float64

In [ ]:
df2[['colA']]

       colA
A -0.731458
B  0.110815
C  0.345313
D  2.299772

In [ ]:
df2[['colB']]

       colB
A -1.605402
B -0.380931
C -1.734959
D -0.471135

In [ ]:
df1

       colA      colB
A -1.454366  0.815270
C  0.229098 -1.026179
E  0.477525  1.292698

In [ ]:
#The output of this operation is the following 
#(since the right-hand-side only had colB):
df1 - df2[['colB']]

   colA      colB
A   NaN  2.420672
B   NaN       NaN
C   NaN  0.708780
D   NaN       NaN
E   NaN       NaN

## Merging and Combining Multiple DataFrames into a single DataFrame

In [ ]:
#Let's now learn how to merge and combine multiple DataFrames 
#into a single Dataframe.

In [ ]:
#Let's start by creating two DataFrames, df1 and df2:

In [ ]:
df1

       colA      colB
A -1.454366  0.815270
C  0.229098 -1.026179
E  0.477525  1.292698

In [ ]:
df1.index.name

In [ ]:
df1.columns.name

In [ ]:
df1.index.name = 'Index'
df1.columns.name = 'Columns'
df1

Columns      colA      colB
Index
A       -1.454366  0.815270
C        0.229098 -1.026179
E        0.477525  1.292698

In [ ]:
df1.index.name

'Index'

In [ ]:
df2

       colA      colB      colC
A -0.731458 -1.605402  0.989476
B  0.110815 -0.380931  0.114959
C  0.345313 -1.734959  1.658351
D  2.299772 -0.471135  1.262715

In [ ]:
df2.index.name = 'Index'
df2.columns.name = 'Columns'
df2

Columns      colA      colB      colC
Index
A       -0.731458 -1.605402  0.989476
B        0.110815 -0.380931  0.114959
C        0.345313 -1.734959  1.658351
D        2.299772 -0.471135  1.262715

The pandas.merge(...) method joins/merges two DataFrames. The left_index= and right_index= parameters indicate that the merge should be performed on Index values in both DataFrames:

In [ ]:
pd.merge(df1, df2, left_index=True, right_index=True)
#That yields the following merged DataFrame. The _x and _y 
#suffixes are added to differentiate between left and right 
#DataFrame columns with the same name.

Columns    colA_x    colB_x    colA_y    colB_y      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
C        0.229098 -1.026179  0.345313 -1.734959  1.658351

In [ ]:
#We can specify custom suffixes with the suffixes= parameter.
#The result is the following DataFrame with the suffixes we 
#provided.
pd.merge(df1, df2, left_index=True, right_index=True, 
         suffixes=('_1', '_2'))

Columns    colA_1    colB_1    colA_2    colB_2      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
C        0.229098 -1.026179  0.345313 -1.734959  1.658351

We can specify the behavior of the join (outer, inner, left, or right join) using the how= parameter:

In [ ]:
display(df1, df2)

Columns      colA      colB
Index
A       -1.454366  0.815270
C        0.229098 -1.026179
E        0.477525  1.292698

Columns      colA      colB      colC
Index
A       -0.731458 -1.605402  0.989476
B        0.110815 -0.380931  0.114959
C        0.345313 -1.734959  1.658351
D        2.299772 -0.471135  1.262715

In [ ]:
#how="outer" performs join using all indexes whether they exist in
#both dataframe or not, so you may see some NaNs as a result.
pd.merge(df1, df2, left_index=True, right_index=True, 
         suffixes=('_1', '_2'), how='outer')

Columns    colA_1    colB_1    colA_2    colB_2      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
B             NaN       NaN  0.110815 -0.380931  0.114959
C        0.229098 -1.026179  0.345313 -1.734959  1.658351
D             NaN       NaN  2.299772 -0.471135  1.262715
E        0.477525  1.292698       NaN       NaN       NaN

In [ ]:
#pandas DataFrames themselves have a pandas.DataFrame.merge(...) 
#method that behaves the same way.
#This yields the following DataFrame with NaNs for missing values.

df1.merge(df2, left_index=True, right_index=True, 
          suffixes=('_1', '_2'), how='outer')

Columns    colA_1    colB_1    colA_2    colB_2      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
B             NaN       NaN  0.110815 -0.380931  0.114959
C        0.229098 -1.026179  0.345313 -1.734959  1.658351
D             NaN       NaN  2.299772 -0.471135  1.262715
E        0.477525  1.292698       NaN       NaN       NaN

In [ ]:
df1

Columns      colA      colB
Index
A       -1.454366  0.815270
C        0.229098 -1.026179
E        0.477525  1.292698

In [ ]:
df2

Columns      colA      colB      colC
Index
A       -0.731458 -1.605402  0.989476
B        0.110815 -0.380931  0.114959
C        0.345313 -1.734959  1.658351
D        2.299772 -0.471135  1.262715

In [ ]:
#The pandas.concat(...) method combines DataFrames by 
#concatenating rows together.This yields the following 
#concatenated DataFrame with NaNs for missing values.
pd.concat([df1, df2])

Columns      colA      colB      colC
Index
A       -1.454366  0.815270       NaN
C        0.229098 -1.026179       NaN
E        0.477525  1.292698       NaN
A       -0.731458 -1.605402  0.989476
B        0.110815 -0.380931  0.114959
C        0.345313 -1.734959  1.658351
D        2.299772 -0.471135  1.262715

In [ ]:
#We can concatenate across columns by specifying the 
#axis= parameter. This yields the following DataFrame 
#with additional columns from df2.
pd.concat([df1, df2], axis=1)

Columns      colA      colB      colA      colB      colC
Index
A       -1.454366  0.815270 -0.731458 -1.605402  0.989476
C        0.229098 -1.026179  0.345313 -1.734959  1.658351
E        0.477525  1.292698       NaN       NaN       NaN
B             NaN       NaN  0.110815 -0.380931  0.114959
D             NaN       NaN  2.299772 -0.471135  1.262715

In [ ]:
#You can also ignore the default index.
pd.concat([df1, df2], ignore_index=True)

Columns      colA      colB      colC
0       -1.454366  0.815270       NaN
1        0.229098 -1.026179       NaN
2        0.477525  1.292698       NaN
3       -0.731458 -1.605402  0.989476
4        0.110815 -0.380931  0.114959
5        0.345313 -1.734959  1.658351
6        2.299772 -0.471135  1.262715

## Transforming Values in DataFrames' axis indices

In [ ]:
#Let's first reinspect the df2 DataFrame that we will 
#be using in these examples:
df2

Columns      colA      colB      colC
Index
A       -0.731458 -1.605402  0.989476
B        0.110815 -0.380931  0.114959
C        0.345313 -1.734959  1.658351
D        2.299772 -0.471135  1.262715

In [ ]:
#We can rename the Index labels using the pandas.DataFrame.index 
#attribute as we saw before:
df2.index = ['Alpha', 'Beta', 'Gamma', 'Delta']
df2

Columns      colA      colB      colC
Alpha   -0.731458 -1.605402  0.989476
Beta     0.110815 -0.380931  0.114959
Gamma    0.345313 -1.734959  1.658351
Delta    2.299772 -0.471135  1.262715

In [ ]:
x = 'John'

In [ ]:
x[:3]

'Joh'

In [ ]:
df2.index

Index(['Alpha', 'Beta', 'Gamma', 'Delta'], dtype='object')

In [ ]:
x = 'Michael'

In [ ]:
x[:3]

'Mic'

In [ ]:
#The pandas.Index.map(...) method applies functions to transform 
#the Index. In the following example, the map function takes the 
#first three characters of the name and sets that as the new name:

df2.index = df2.index.map(lambda x : x[:3])
df2

Columns      colA      colB      colC
Alp     -0.731458 -1.605402  0.989476
Bet      0.110815 -0.380931  0.114959
Gam      0.345313 -1.734959  1.658351
Del      2.299772 -0.471135  1.262715

In [ ]:
#The pandas.DataFrame.rename(...) method lets us transform 
#both Index names and column names and accepts a dictionary 
#mapping from the old name to the new name:

df2.rename(index={'Alp': 0, 'Bet': 1, 'Gam': 2, 'Del': 3}, 
           columns={'colA': 'A', 'colB': 'B', 'colC': 'C'})

Columns         A         B         C
0       -0.731458 -1.605402  0.989476
1        0.110815 -0.380931  0.114959
2        0.345313 -1.734959  1.658351
3        2.299772 -0.471135  1.262715

## Handling missing data in DataFrames

With all these lessons learned, we will learn how to handle missing data in DataFrames.

Missing data is a common phenomenon in data science and can happen for multiple reasons – for example, database error, other technical error, human error, holiday.

### Filtering out missing data

When dealing with missing data, a quick option is to remove all observations with any missing data. Though there are several better options to use that preserves your data rather than outright deletion. We would later learn these other options as we go along in this course and even in subsequent courses,since we would most times find ourselves doing data cleaning before any other thing. And mind this, data cleaning consume up to 70% of a data scientist time on a project!!

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
df2

In [ ]:
#This code block modifies the df2 DataFrame using the
#pandas.DataFrame.at[...] attribute and sets some values to NaN:
for row, col in [('Bet', 'colA'), ('Bet', 'colB'), ('Bet', 'colC'), ('Del', 'colB'), ('Gam', 'colC')]:
    df2.at[row, col] = np.NaN

df2

In [ ]:
#The pandas.DataFrame.isnull(...) method finds missing values in a DataFrame.
#The result is a DataFrame with True where values are missing and False otherwise.
df2.isnull()

In [ ]:
#The pandas.DataFrame.notnull(...) method does the opposite (detects non-missing values):
df2.notnull()

In [ ]:
df2

In [ ]:
df2.isna().sum() #returns aggregate of missing values in each column

In [ ]:
df2.isnull().sum().sum()

In [ ]:
#The pandas.DataFrame.dropna(...) method allows us to drop 
#rows with missing values. The additional how= parameter controls
#which rows get dropped. To drop rows that have NaN for all fields, we do the following.
#The result is the following modified DataFrame with the Bet row removed since that was the only one with all NaN.
df2.dropna(how='all')

In [ ]:
#Setting how= to any removes rows with any NaN values.
#This gives us the following DataFrame with all non-NaN values:
df2.dropna(how='any')

In [ ]:
df2.isnull().sum().sum()

### Filling in missing data

We will now look at how to fill in missing data.

The second option when dealing with missing data is to fill in the missing values either with a value of our choice or using other valid values in the same column to duplicate/extrapolate the missing values.

In [ ]:
#Let's start by re-inspecting the df2 DataFrame.
#This yields the following DataFrame with some missing values:
df2

In [ ]:
#Now, let's use the pandas.DataFrame.fillna(...) method with the method='backfill' 
#and inplace=True arguments to use the backfill method to backward fill the missing values from the other values and change the DataFrame in place:

df2.fillna(method='bfill', inplace=True)
df2

In [ ]:
#NOTE: From the result above, The NaN value at (Del,colB) is because there were no observations after that row, so backfill could not be performed. 
# But, that can be fixed instead with forward fill.

In [ ]:
df2.fillna(method = 'ffill', inplace = True)

In [ ]:
df2

## Transformation of DataFrames with Functions and Mappings

pandas DataFrame values can also be modified by passing functions and dictionary mappings that operate on one or more data values and generate new transformed values.

Let's modify the df2 DataFrame by adding a new column, Category, containing discrete text data:

In [ ]:
df2['Category']

In [ ]:
df2['Category'] = ['HIGH', 'LOW', 'LOW', 'HIGH']
df2

In [ ]:
#The pandas.Series.map(...) method accepts a dictionary 
#containing a mapping from the old value to the new value and 
#transforms the values. The following snippet changes the text 
#values in Category to single characters:
df2['Category'] = df2['Category'].map({'HIGH': 'H', 'LOW': 'L'})
df2

## Discretization / Bucketing of DataFrame's values

The simplest way to achieve discretization is to create ranges of values and assign a single discrete label to all values that fall within a certain bucket.

First, let's generate a random valued ndarray for our use:

In [ ]:
arr = np.random.randn(10)
arr

In [ ]:
#The pandas.cut(...) method can be used to discretize these values. 
#The following code uses the bins= and labels=[...] arguments to 
#bin the values into five discrete values with the labels provided:
cat = pd.cut(arr, bins=5, 
             labels=['Very Low', 'Low', 'Med', 'High', 'Very High'])
cat

In [ ]:
pd.DataFrame({'Value': arr, 'Category': cat})

In [ ]:
#The pandas.qcut(...) method is similar but uses quartiles to 
#bin the continuous values to discrete values so that each 
#category has the same amount of observations.
#The following builds five discrete bins using the q= parameter:

qcat = pd.qcut(arr, q=5, 
               labels=['Very Low', 'Low', 'Med', 'High', 'Very High'])
qcat

In [ ]:
#The following code block builds a pandas DataFrame 
#consisting of the original continuous values as well as the 
#categories generated from cut and qcut:
pd.DataFrame({'Value': arr, 'Category': cat, 
              'Quartile Category': qcat})

In [ ]:
#The pandas.Categorical.categories attribute provides us 
#with the bucket ranges:
pd.cut(arr, bins=5).categories

In [ ]:
#We can inspect the buckets for qcut as well. 
#They are quite different from the one above.
pd.qcut(arr, q=5).categories

## Permuting and Sampling of DataFrames Values to Generate new DataFrames

Permuting available datasets to generate new datasets and sampling datasets to either sub-sample (reduce the number of observations) or super-sample (increase the number of observations) are common operations in statistical analysis.

In [ ]:
import pandas as pd
import numpy as np

In [ ]:
#First, let's generate a DataFrame of random values to work with:
df = pd.DataFrame(np.random.randn(10,5), 
                  index=np.sort(np.random.randint(0, 100, size=10)),
                  columns=list('ABCDE'))
df

           A         B         C         D         E
6  -0.408990  1.236709 -0.532281 -0.249674  1.250225
17 -0.241973  0.146086 -1.106059  1.334223 -1.368187
48 -0.108104 -1.337010  0.761675  0.315462 -1.240366
53 -0.305116  0.561282 -0.903246  1.203187 -1.361112
64  0.757960 -2.410400 -0.813214  0.984979 -0.363891
64  1.605815 -0.342392 -0.768160  0.024118  0.498116
72  0.937465 -0.116423 -0.400136 -1.673957  0.491555
72 -0.715211  0.556665  1.073624  0.685361 -0.956679
73  1.348712 -0.894434  0.973483  1.090710  1.058841
89  0.709441  1.475943  0.699074 -0.808601  0.733136

In [ ]:
df.index

Int64Index([6, 17, 48, 53, 64, 64, 72, 72, 73, 89], dtype='int64')

In [ ]:
np.random.permutation(df.index)

array([89, 64, 72, 17, 72,  6, 48, 73, 64, 53], dtype=int64)

In [ ]:
#The numpy.random.permutation(...) method, when applied to a 
#DataFrame, randomly shuffles along the Index axis and can be 
#used to permute the rows in the dataset:

df.loc[np.random.permutation(df.index)]

           A         B         C         D         E
89  0.709441  1.475943  0.699074 -0.808601  0.733136
17 -0.241973  0.146086 -1.106059  1.334223 -1.368187
6  -0.408990  1.236709 -0.532281 -0.249674  1.250225
72  0.937465 -0.116423 -0.400136 -1.673957  0.491555
72 -0.715211  0.556665  1.073624  0.685361 -0.956679
73  1.348712 -0.894434  0.973483  1.090710  1.058841
64  0.757960 -2.410400 -0.813214  0.984979 -0.363891
64  1.605815 -0.342392 -0.768160  0.024118  0.498116
48 -0.108104 -1.337010  0.761675  0.315462 -1.240366
53 -0.305116  0.561282 -0.903246  1.203187 -1.361112
72  0.937465 -0.116423 -0.400136 -1.673957  0.491555
72 -0.715211  0.556665  1.073624  0.685361 -0.956679
64  0.757960 -2.410400 -0.813214  0.984979 -0.363891
64  1.605815 -0.342392 -0.768160  0.024118  0.498116

We can use the numpy.random.randint(...) method to generate random integers within a certain range and then use the pandas.DataFrame.iloc[...] attribute to randomly sample with replacement (the same observation can be picked more than once) from our DataFrame.

In [ ]:
np.random.randint(0, len(df), size=5)

array([7, 6, 3, 7, 3])

In [ ]:
#The following code block picks out five rows randomly 
#sampled with replacement:
df.iloc[np.random.randint(0, len(df), size=5)]

           A         B         C         D         E
48 -0.108104 -1.337010  0.761675  0.315462 -1.240366
72  0.937465 -0.116423 -0.400136 -1.673957  0.491555
72 -0.715211  0.556665  1.073624  0.685361 -0.956679
73  1.348712 -0.894434  0.973483  1.090710  1.058841
73  1.348712 -0.894434  0.973483  1.090710  1.058841

# File operations with DataFrames

pandas supports the persistence of DataFrames in both plain-text and binary formats. The common text formats are CSV and JSON files, the most used binary formats are Excel XLSX, HDF5, and pickle.

In this session, we focus on plain-text persistence.

## CSV files

CSV files (comma-separated values files) are data-exchange standard files.

Writing a pandas DataFrame to a CSV file is easily achievable using the pandas.DataFrame.to_csv(...) method. The header= parameter controls whether a header is written to the top of the file or not and the index= parameter controls whether the Index axis values are written to the file or not.

### Writing csv files

In [ ]:
df

           A         B         C         D         E
6  -0.408990  1.236709 -0.532281 -0.249674  1.250225
17 -0.241973  0.146086 -1.106059  1.334223 -1.368187
48 -0.108104 -1.337010  0.761675  0.315462 -1.240366
53 -0.305116  0.561282 -0.903246  1.203187 -1.361112
64  0.757960 -2.410400 -0.813214  0.984979 -0.363891
64  1.605815 -0.342392 -0.768160  0.024118  0.498116
72  0.937465 -0.116423 -0.400136 -1.673957  0.491555
72 -0.715211  0.556665  1.073624  0.685361 -0.956679
73  1.348712 -0.894434  0.973483  1.090710  1.058841
89  0.709441  1.475943  0.699074 -0.808601  0.733136

In [ ]:
df.to_csv('df.csv', sep=',', header=True, index=True)

In [ ]:
%pycat df.csv

### Reading csv files

Reading a CSV file and building a pandas DataFrame from the data in it can be achieved using the pandas.read_csv(...) method. Here we will specify the character (although that is the default for read_csv), the index_col= parameter to specify which column to treat as the Index of the DataFrame, and the nrows= parameter to specify how many rows to read in.

In [ ]:
#This builds the following DataFrame, which is the same 
#DataFrame that was written to disk:
data_1 = pd.read_csv('df.csv', sep=',', index_col=0, nrows=5)

In [ ]:
data_1

           A         B         C         D         E
6  -0.408990  1.236709 -0.532281 -0.249674  1.250225
17 -0.241973  0.146086 -1.106059  1.334223 -1.368187
48 -0.108104 -1.337010  0.761675  0.315462 -1.240366
53 -0.305116  0.561282 -0.903246  1.203187 -1.361112
64  0.757960 -2.410400 -0.813214  0.984979 -0.363891

In [ ]:
data_2 = pd.read_csv("C:/Users/user/df.csv", nrows = 6, index_col = 0)

In [ ]:
data_2

           A         B         C         D         E
6  -0.408990  1.236709 -0.532281 -0.249674  1.250225
17 -0.241973  0.146086 -1.106059  1.334223 -1.368187
48 -0.108104 -1.337010  0.761675  0.315462 -1.240366
53 -0.305116  0.561282 -0.903246  1.203187 -1.361112
64  0.757960 -2.410400 -0.813214  0.984979 -0.363891
64  1.605815 -0.342392 -0.768160  0.024118  0.498116

In [ ]:
loan_df = pd.read_csv("C:/Users/user/Documents/loan.csv")

In [ ]:
loan_df.head()

,Loan_ID,Gender,Married,Dependents,Education,Self_Employed,ApplicantIncome,CoapplicantIncome,LoanAmount,Loan_Amount_Term,Credit_History,Property_Area,Loan_Status
0,LP001002,Male,No,0,Graduate,No,5849,0.0,NaN,360.0,1.0,Urban,Y
1,LP001003,Male,Yes,1,Graduate,No,4583,1508.0,128.0,360.0,1.0,Rural,N
2,LP001005,Male,Yes,0,Graduate,Yes,3000,0.0,66.0,360.0,1.0,Urban,Y
3,LP001006,Male,Yes,0,Not Graduate,No,2583,2358.0,120.0,360.0,1.0,Urban,Y
4,LP001008,Male,No,0,Graduate,No,6000,0.0,141.0,360.0,1.0,Urban,Y

In [ ]:
#We can also specify the chunksize= parameter, which 
#reads in the specified number of lines at a time, which can 
#help when exploring very large datasets contained in very large 
#files:
pd.read_csv('df.csv', sep=',', index_col=0, chunksize=2)

In [ ]:
#We can wrap it in a list and observe the entire DataFrame 
#loaded in chunks of two lines:

list(pd.read_csv('df.csv', sep=',', index_col=0, chunksize=2))

[           A         B         C         D         E
 6  -0.408990  1.236709 -0.532281 -0.249674  1.250225
 17 -0.241973  0.146086 -1.106059  1.334223 -1.368187,
            A         B         C         D         E
 48 -0.108104 -1.337010  0.761675  0.315462 -1.240366
 53 -0.305116  0.561282 -0.903246  1.203187 -1.361112,
            A         B         C         D         E
 64  0.757960 -2.410400 -0.813214  0.984979 -0.363891
 64  1.605815 -0.342392 -0.768160  0.024118  0.498116,
            A         B         C         D         E
 72  0.937465 -0.116423 -0.400136 -1.673957  0.491555
 72 -0.715211  0.556665  1.073624  0.685361 -0.956679,
            A         B         C         D         E
 73  1.348712 -0.894434  0.973483  1.090710  1.058841
 89  0.709441  1.475943  0.699074 -0.808601  0.733136]

## JSON Files

JSON files are based upon data structures identical to Python dictionaries. This makes JSON files very convenient for many purposes including representing DataFrames as well as representing configuration files.

The pandas.DataFrame.to_json(...) method conveniently writes a DataFrame to a JSON file on disk.

In [ ]:
#Here we write only the first four rows:
df.iloc[:4].to_json('df.json')

In [ ]:
#Let's check out the JSON file written to disk:
%pycat df.json

In [ ]:
#Reading JSON files back into Pandas DataFrames is 
#just as easy with the pandas.read_json(...) method:
pd.read_json('df.json')

           A         B         C         D         E
6  -0.408990  1.236709 -0.532281 -0.249674  1.250225
17 -0.241973  0.146086 -1.106059  1.334223 -1.368187
48 -0.108104 -1.337010  0.761675  0.315462 -1.240366
53 -0.305116  0.561282 -0.903246  1.203187 -1.361112

In [ ]:
#This gives us back the original JSON four-row DataFrame that was written to disk

# Summary

This course has equpiped you with knowledge of pandas library, upon which the majority, if not all, data manipulation operations in Python are done. We have learned how to create a DataFrame, how to alter it, and how to persist it.

Pandas DataFrames are principally for high-performance bulk data manipulation, selecting and reshaping data. They are the Python version of Excel worksheets.

In the next course, we will investigate visualization in Python using Matplotlib.

Congratulations!!, see you next time.